In [1]:
import os, pandas as pd
os.chdir(r'D:\새 폴더\Programing\Academy\Python\day0826')
from IPython.display import display

In [2]:
# 판다스 버전검색
print(pd.__version__)

2.3.2

In [3]:
# 판다스 자료구조
# Series : 한줄짜리 표
data1=[10,20,30,40,50]
s1=pd.Series(data1)
print(s1)
print(s1.index)

0    10
1    20
2    30
3    40
4    50
dtype: int64
RangeIndex(start=0, stop=5, step=1)

In [4]:
# DataFrame : dict -> 표(테이블) 
data = {'name' : ['Mark','Jane','Chris','Ryan'],
 'age': [33, 32, 44, 42],
 'score': [91.3, 83.4, 77.5, 87.7]}

df = pd.DataFrame(data)

print(df)

    name  age  score
0   Mark   33   91.3
1   Jane   32   83.4
2  Chris   44   77.5
3   Ryan   42   87.7

In [5]:
# 인덱스와 컬럼에 특정 값을 적용
data2=['A','B','C','D','E']
df2=pd.DataFrame([[89.2,92.6,90.8],[92.8,89.9,95.2]],index=['중간','기말'],columns=data2[0:3])
print(df2)

       A     B     C
중간  89.2  92.6  90.8
기말  92.8  89.9  95.2

In [6]:
# 인덱스와 컬럼에 특정 값을 나중에 적용

data_df = [['20251101', 'Hong', '90', '95'], 
           ['20251102','Kim', '93', '94'], 
           ['20251103', 'Lee', '87', '97']]
df3 = pd.DataFrame(data_df)
display(df3) # display 쓰면 해당 데이터프레임을 표형식으로 출력
df3.columns = ['학번', '이름', '중간고사', '기말고사']
display(df3)

          0     1   2   3
0  20251101  Hong  90  95
1  20251102   Kim  93  94
2  20251103   Lee  87  97

         학번    이름 중간고사 기말고사
0  20251101  Hong   90   95
1  20251102   Kim   93   94
2  20251103   Lee   87   97

In [7]:
# 위에서 부터 n개 출력
df3.head(2)

         학번    이름 중간고사 기말고사
0  20251101  Hong   90   95
1  20251102   Kim   93   94

In [8]:
# 밑에서 부터 n개 출력
df3.tail(2)

         학번   이름 중간고사 기말고사
1  20251102  Kim   93   94
2  20251103  Lee   87   97

In [9]:
# 인덱스의 값을 넣어 특정 컬럼값만 출력
df3['이름']

0    Hong
1     Kim
2     Lee
Name: 이름, dtype: object

In [10]:
# 컬럼으로 열삭제
df3.drop(columns='학번') # 원본 적용 x
display(df3)
df3.drop(columns='학번',inplace=True) # 원본 적용
display(df3)

         학번    이름 중간고사 기말고사
0  20251101  Hong   90   95
1  20251102   Kim   93   94
2  20251103   Lee   87   97

     이름 중간고사 기말고사
0  Hong   90   95
1   Kim   93   94
2   Lee   87   97

In [11]:
# 인덱스로 행 삭제
df3.drop(0,inplace=True)
df3

    이름 중간고사 기말고사
1  Kim   93   94
2  Lee   87   97

In [12]:
# 컬럼 값 수정
df3.rename(columns={df3.columns[0]: 'Name', df3.columns[1]:'Mid'},inplace=True)
df3

  Name Mid 기말고사
1  Kim  93   94
2  Lee  87   97

In [13]:
df

    name  age  score
0   Mark   33   91.3
1   Jane   32   83.4
2  Chris   44   77.5
3   Ryan   42   87.7

In [14]:
# sum() : 각 컬럼의 값을 더 함
# 문자열을 이어쓰기 되는듯
df.sum()

name     MarkJaneChrisRyan
age                    151
score                339.9
dtype: object

In [15]:
# mean() : 특정 컬럼의 값의 평균
df['age'].mean()

np.float64(37.75)